# Cable Size Properties

Source: https://www.revitapidocs.com/2026/ed604033-a978-294e-831c-cb29d4ba12a6.htm

---

| Cable Size Properties |
| --- |

The CableSize type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | Comments | The comments of this Cable Size. |
|  | GroundConductorSize | The size of a Ground Conductor. |
|  | HotConductorSize | The size of a Hot Conductor. |
|  | Id | The Cable Size id. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The name of this Cable Size. |
|  | NeutralConductorSize | The size of a Neutral Conductor. |
|  | NumberOfGroundConductors | The number of Ground Conductors. |
|  | NumberOfHotConductors | The number of Hot Conductors. |
|  | NumberOfNeutralConductors | The number of Neutral Conductors. |
|  | NumberOfOtherConductors | The number of Other Conductors. |
|  | OtherConductorSize | The size of an Other Conductor. |

Top See Also

#### Reference

CableSize Class Autodesk.Revit.DB.Electrical Namespace